---
kind: property
id: P:Autodesk.Revit.DB.IntersectionResult.UVPoint
source: html/4a3005d1-9ebf-f2f6-d480-6d5403c38f14.htm
---
# Autodesk.Revit.DB.IntersectionResult.UVPoint Property

2d (or two 1d) parameters of the point of intersection.

## Syntax (C#)
```csharp
public UV UVPoint { get; internal set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown in the getter when this property has not been set by the method providing the result.